Revit 2027 API
RebarInSystem.ResetMovedBarTransform Method
 Reset the transformation representing the movement of the bar relative to its default position along the distribution path. The moved bar transform will be set to Identity.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ResetMovedBarTransform(
	int barPositionIndex
)
Public Sub ResetMovedBarTransform (
	barPositionIndex As Integer
)
public:
void ResetMovedBarTransform(
	int barPositionIndex
)
member ResetMovedBarTransform :
        barPositionIndex : int -> unit
Parameters
barPositionIndex Int32
 The bar index.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
InapplicableDataException |  For this RebarInSystem element individual bars can't be moved, excluded or included.
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace